particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
/*
 * Copyright (c) 2020 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHAN'TABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "nrf_uarte.h"
#include "sleep_hal.h"
#include <malloc.h>
#include <nrfx_types.h>
#include <nrf_mbr.h>
#include <nrf_sdm.h>
#include <nrf_sdh.h>
#include <nrf_rtc.h>
#include <nrf_lpcomp.h>
#include <nrfx_gpiote.h>
#include <nrf_drv_clock.h>
#include <nrf_pwm.h>
#include "gpio_hal.h"
#include "usb_hal.h"
#include "usart_hal.h"
#include "i2c_hal.h"
#include "spi_hal.h"
#include "adc_hal.h"
#include "pwm_hal.h"
#include "flash_common.h"
#include "exflash_hal.h"
#include "rtc_hal.h"
#include "timer_hal.h"
#include "ble_hal.h"
#include "interrupts_hal.h"
#include "concurrent_hal.h"
#include "check.h"
#include "radio_common.h"
#include "spark_wiring_vector.h"
#include "platform_ncp.h"
#include "exrtc_hal_internal.h"

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
#include "mcp23s17.h"
#endif
#endif

using namespace particle;

namespace {

struct WakeupSourcePriorityCache {
    WakeupSourcePriorityCache() {
        memset((uint8_t*)this, 0xFF, sizeof(WakeupSourcePriorityCache));
    }

    uint32_t gpiotePriority;
    uint32_t rtc2Priority;
    uint32_t blePriority;
    uint32_t lpcompPriority;
    uint32_t usart0Priority;
    uint32_t usart1Priority;
};

constexpr uint32_t INVALID_INT_PRIORITY = 0xFFFFFFFF;

constexpr nrf_gpiote_events_t gpioteEvents[GPIOTE_CH_NUM] = {
    NRF_GPIOTE_EVENTS_IN_0,
    NRF_GPIOTE_EVENTS_IN_1,
    NRF_GPIOTE_EVENTS_IN_2,
    NRF_GPIOTE_EVENTS_IN_3,
    NRF_GPIOTE_EVENTS_IN_4,
    NRF_GPIOTE_EVENTS_IN_5,
    NRF_GPIOTE_EVENTS_IN_6,
    NRF_GPIOTE_EVENTS_IN_7
};

} /* Anonymous namespace  */

static void bumpWakeupSourcesPriority(const hal_wakeup_source_base_t* wakeupSources, WakeupSourcePriorityCache* priority, uint32_t newPriority) {
    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            if (priority->gpiotePriority == INVALID_INT_PRIORITY) {
                priority->gpiotePriority = NVIC_GetPriority(GPIOTE_IRQn);
            }
            NVIC_SetPriority(GPIOTE_IRQn, newPriority);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            if (priority->rtc2Priority == INVALID_INT_PRIORITY) {
                priority->rtc2Priority = NVIC_GetPriority(RTC2_IRQn);
            }
            NVIC_SetPriority(RTC2_IRQn, newPriority);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_BLE) {
            if (priority->blePriority == INVALID_INT_PRIORITY) {
                priority->blePriority = NVIC_GetPriority(SD_EVT_IRQn);
            }
            NVIC_SetPriority(SD_EVT_IRQn, newPriority);
            NVIC_EnableIRQ(SD_EVT_IRQn);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
            if (priority->lpcompPriority == INVALID_INT_PRIORITY) {
                priority->lpcompPriority = NVIC_GetPriority(COMP_LPCOMP_IRQn);
            }
            NVIC_SetPriority(COMP_LPCOMP_IRQn, newPriority);
            NVIC_EnableIRQ(COMP_LPCOMP_IRQn);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
            if (priority->usart0Priority == INVALID_INT_PRIORITY) {
                priority->usart0Priority = NVIC_GetPriority(UARTE0_UART0_IRQn);
            }
            NVIC_SetPriority(UARTE0_UART0_IRQn, newPriority);
            nrf_uarte_int_enable(NRF_UARTE0, NRF_UARTE_INT_RXDRDY_MASK);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
            auto network = reinterpret_cast<const hal_wakeup_source_network_t*>(source);
            if (!(network->flags & HAL_SLEEP_NETWORK_FLAG_INACTIVE_STANDBY)) {
                if (priority->usart1Priority == INVALID_INT_PRIORITY) {
                    priority->usart1Priority = NVIC_GetPriority(UARTE1_IRQn);
                }
                NVIC_SetPriority(UARTE1_IRQn, newPriority);
                nrf_uarte_int_enable(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK);
            }
        }
        source = source->next;
    }
}

static void unbumpWakeupSourcesPriority(const hal_wakeup_source_base_t* wakeupSources, WakeupSourcePriorityCache* priority) {
    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            if (priority->gpiotePriority != INVALID_INT_PRIORITY) {
                NVIC_SetPriority(GPIOTE_IRQn, priority->gpiotePriority);
                priority->gpiotePriority = INVALID_INT_PRIORITY;
            }
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            if (priority->rtc2Priority != INVALID_INT_PRIORITY) {
                NVIC_SetPriority(RTC2_IRQn, priority->rtc2Priority);
                priority->rtc2Priority = INVALID_INT_PRIORITY;
            }
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_BLE) {
            if (priority->blePriority != INVALID_INT_PRIORITY) {
                NVIC_SetPriority(SD_EVT_IRQn, priority->blePriority);
                priority->blePriority = INVALID_INT_PRIORITY;
            }
            NVIC_DisableIRQ(SD_EVT_IRQn);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
            // FIXME: dirty hack, since we nowhere implemented the IRQ handler.
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_READY);
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_DOWN);
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_UP);
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_CROSS);
            NVIC_DisableIRQ(COMP_LPCOMP_IRQn);
            NVIC_ClearPendingIRQ(COMP_LPCOMP_IRQn);
            if (priority->lpcompPriority != INVALID_INT_PRIORITY) {
                NVIC_SetPriority(COMP_LPCOMP_IRQn, priority->lpcompPriority);
                priority->lpcompPriority = INVALID_INT_PRIORITY;
            }
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
            if (priority->usart0Priority != INVALID_INT_PRIORITY) {
                NVIC_SetPriority(UARTE0_UART0_IRQn, priority->usart0Priority);
                priority->usart0Priority = INVALID_INT_PRIORITY;
            }
            nrf_uarte_int_disable(NRF_UARTE0, NRF_UARTE_INT_RXDRDY_MASK);
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
            auto network = reinterpret_cast<const hal_wakeup_source_network_t*>(source);
            if (!(network->flags & HAL_SLEEP_NETWORK_FLAG_INACTIVE_STANDBY)) {
                if (priority->usart1Priority != INVALID_INT_PRIORITY) {
                    NVIC_SetPriority(UARTE1_IRQn, priority->usart1Priority);
                    priority->usart1Priority = INVALID_INT_PRIORITY;
                }
                nrf_uarte_int_disable(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK);
            }
        }
        source = source->next;
    }
}

static int constructGpioWakeupReason(hal_wakeup_source_base_t** wakeupReason, hal_pin_t pin) {
    auto gpio = (hal_wakeup_source_gpio_t*)malloc(sizeof(hal_wakeup_source_gpio_t));
    if (gpio) {
        gpio->base.size = sizeof(hal_wakeup_source_gpio_t);
        gpio->base.version = HAL_SLEEP_VERSION;
        gpio->base.type = HAL_WAKEUP_SOURCE_TYPE_GPIO;
        gpio->base.next = nullptr;
        gpio->pin = pin;
        *wakeupReason = reinterpret_cast<hal_wakeup_source_base_t*>(gpio);
    } else {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

