particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
static int constructRtcWakeupReason(hal_wakeup_source_base_t** wakeupReason) {
    auto rtc = (hal_wakeup_source_rtc_t*)malloc(sizeof(hal_wakeup_source_rtc_t));
    if (rtc) {
        rtc->base.size = sizeof(hal_wakeup_source_rtc_t);
        rtc->base.version = HAL_SLEEP_VERSION;
        rtc->base.type = HAL_WAKEUP_SOURCE_TYPE_RTC;
        rtc->base.next = nullptr;
        rtc->ms = 0;
        *wakeupReason = reinterpret_cast<hal_wakeup_source_base_t*>(rtc);
    } else {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

static int constructUsartWakeupReason(hal_wakeup_source_base_t** wakeupReason) {
    auto usart = (hal_wakeup_source_usart_t*)malloc(sizeof(hal_wakeup_source_usart_t));
    if (usart) {
        usart->base.size = sizeof(hal_wakeup_source_usart_t);
        usart->base.version = HAL_SLEEP_VERSION;
        usart->base.type = HAL_WAKEUP_SOURCE_TYPE_USART;
        usart->base.next = nullptr;
        usart->serial = HAL_USART_SERIAL1;
        *wakeupReason = reinterpret_cast<hal_wakeup_source_base_t*>(usart);
    } else {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

static int constructBleWakeupReason(hal_wakeup_source_base_t** wakeupReason) {
    auto ble = (hal_wakeup_source_base_t*)malloc(sizeof(hal_wakeup_source_base_t));
    if (ble) {
        ble->size = sizeof(hal_wakeup_source_base_t);
        ble->version = HAL_SLEEP_VERSION;
        ble->type = HAL_WAKEUP_SOURCE_TYPE_BLE;
        ble->next = nullptr;
        *wakeupReason = ble;
    } else {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

static int constructLpcompWakeupReason(hal_wakeup_source_base_t** wakeupReason, hal_pin_t pin) {
    auto lpcomp = (hal_wakeup_source_lpcomp_t*)malloc(sizeof(hal_wakeup_source_lpcomp_t));
    if (lpcomp) {
        lpcomp->base.size = sizeof(hal_wakeup_source_lpcomp_t);
        lpcomp->base.version = HAL_SLEEP_VERSION;
        lpcomp->base.type = HAL_WAKEUP_SOURCE_TYPE_LPCOMP;
        lpcomp->base.next = nullptr;
        lpcomp->pin = pin;
        *wakeupReason = reinterpret_cast<hal_wakeup_source_base_t*>(lpcomp);
    } else {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

static int constructNetworkWakeupReason(hal_wakeup_source_base_t** wakeupReason, network_interface_index index) {
    auto network = (hal_wakeup_source_network_t*)malloc(sizeof(hal_wakeup_source_network_t));
    if (network) {
        network->base.size = sizeof(hal_wakeup_source_base_t);
        network->base.version = HAL_SLEEP_VERSION;
        network->base.type = HAL_WAKEUP_SOURCE_TYPE_NETWORK;
        network->base.next = nullptr;
        network->index = index;
        *wakeupReason = reinterpret_cast<hal_wakeup_source_base_t*>(network);
    } else {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    return SYSTEM_ERROR_NONE;
}

static const hal_wakeup_source_base_t* findWakeupSource(const hal_wakeup_source_base_t* wakeupSources, hal_wakeup_source_type_t type) {
    auto source = wakeupSources;
    while (source) {
        if (source->type == type) {
            return source;
        }
        source = source->next;
    }
    return nullptr;
}

static void configGpioWakeupSource(const hal_wakeup_source_base_t* wakeupSources) {
    uint32_t gpioIntenSet = 0;
    hal_pin_info_t* halPinMap = hal_pin_map();

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
    bool ioExpanderIntConfigured = false;
#endif
#endif

    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            nrf_gpio_pin_pull_t wakeupPinMode;
            nrf_gpio_pin_sense_t wakeupPinSense;
            nrf_gpiote_polarity_t wakeupPinPolarity;
            uint32_t nrfPin;
            auto gpioWakeup = reinterpret_cast<const hal_wakeup_source_gpio_t*>(source);
#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
            if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_MCU) {
#endif
                switch(gpioWakeup->mode) {
                    case RISING: {
                        wakeupPinMode = NRF_GPIO_PIN_PULLDOWN;
                        wakeupPinSense = NRF_GPIO_PIN_SENSE_HIGH;
                        wakeupPinPolarity = NRF_GPIOTE_POLARITY_LOTOHI;
                        break;
                    }
                    case FALLING: {
                        wakeupPinMode = NRF_GPIO_PIN_PULLUP;
                        wakeupPinSense = NRF_GPIO_PIN_SENSE_LOW;
                        wakeupPinPolarity = NRF_GPIOTE_POLARITY_HITOLO;
                        break;
                    }
                    case CHANGE:
                    default: {
                        wakeupPinMode = NRF_GPIO_PIN_NOPULL;
                        wakeupPinPolarity = NRF_GPIOTE_POLARITY_TOGGLE;
                        break;
                    }
                }
                // For any pin that is not currently configured in GPIOTE with IN event
                // we are going to use low power PORT events
                nrfPin = NRF_GPIO_PIN_MAP(halPinMap[gpioWakeup->pin].gpio_port, halPinMap[gpioWakeup->pin].gpio_pin);
#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
            }
#if HAL_PLATFORM_MCP23S17
            else if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER && !ioExpanderIntConfigured) {
                ioExpanderIntConfigured = true;
                wakeupPinMode = NRF_GPIO_PIN_PULLUP;
                wakeupPinSense = NRF_GPIO_PIN_SENSE_LOW;
                wakeupPinPolarity = NRF_GPIOTE_POLARITY_HITOLO;
                nrfPin = NRF_GPIO_PIN_MAP(halPinMap[IOE_INT].gpio_port, halPinMap[IOE_INT].gpio_pin);
            }
#endif
            else {
                source = source->next;
                continue;
            }
#endif
            // Set pin mode
            nrf_gpio_cfg_input(nrfPin, wakeupPinMode);
            bool usePortEvent = true;
            for (unsigned i = 0; i < GPIOTE_CH_NUM; ++i) {
                if ((nrf_gpiote_event_pin_get(i) == nrfPin) && nrf_gpiote_int_is_enabled(NRF_GPIOTE_INT_IN0_MASK << i)) {
                    // We have to use IN event for this pin in order to successfully execute interrupt handler
                    usePortEvent = false;
                    nrf_gpiote_event_configure(i, nrfPin, wakeupPinPolarity);
                    gpioIntenSet |= NRF_GPIOTE_INT_IN0_MASK << i;
                    break;
                }
            }
            if (usePortEvent) {
                // Use PORT for this pin
                if (wakeupPinMode == NRF_GPIO_PIN_NOPULL) {
                    // Read current state, choose sense accordingly
                    // Dummy read just in case
                    (void)nrf_gpio_pin_read(nrfPin);
                    uint32_t cur_state = nrf_gpio_pin_read(nrfPin);
                    if (cur_state) {
                        nrf_gpio_cfg_sense_set(nrfPin, NRF_GPIO_PIN_SENSE_LOW);
                    } else {
                        nrf_gpio_cfg_sense_set(nrfPin, NRF_GPIO_PIN_SENSE_HIGH);
                    }
                } else {
                    nrf_gpio_cfg_sense_input(nrfPin, wakeupPinMode, wakeupPinSense);
                }
                gpioIntenSet |= NRF_GPIOTE_INT_PORT_MASK;
            }
        }
        source = source->next;
    }
    
    if (gpioIntenSet > 0) {
        uint32_t curIntenSet = NRF_GPIOTE->INTENSET;
        nrf_gpiote_int_disable(curIntenSet);

        // Clear events and interrupts
        uint32_t ioeNrfPin = 0xFFFFFFFF;
#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
        /* The GPIOTE event associated with IOE_INT is probably set after we configured
           the IO expander interrupts. Do not clear it and use it to wake up device.
           Otherwise, we will miss the interrupt triggered by IO expander. */
        ioeNrfPin = NRF_GPIO_PIN_MAP(halPinMap[IOE_INT].gpio_port, halPinMap[IOE_INT].gpio_pin);
#endif
#endif
        for (uint8_t i = 0; i < GPIOTE_CH_NUM; i++) {
            if (nrf_gpiote_event_pin_get(i) != ioeNrfPin) {
                nrf_gpiote_event_clear(gpioteEvents[i]);
            }
        }
        nrf_gpiote_event_clear(NRF_GPIOTE_EVENTS_PORT);
        NVIC_ClearPendingIRQ(GPIOTE_IRQn);
        nrf_gpiote_int_enable(gpioIntenSet);
        NVIC_EnableIRQ(GPIOTE_IRQn);
    }
}

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
static void configGpioWakeupSourceExt(const hal_wakeup_source_base_t* wakeupSources, hal_sleep_mode_t sleepMode) {
    hal_pin_info_t* halPinMap = hal_pin_map();
    auto source = wakeupSources;
    bool config = false;
    uint8_t gpIntEn[2] = {0, 0};
    uint8_t intCon[2] = {0, 0};
    uint8_t defVal[2] = {0, 0};

    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            auto gpioWakeup = reinterpret_cast<const hal_wakeup_source_gpio_t*>(source);
            if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER) {
                config = true;
                switch(gpioWakeup->mode) {
                    case RISING: {
                        intCon[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                        break;
                    }
                    case FALLING: {
                        intCon[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                        defVal[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
                        break;
                    }
                    case CHANGE:
                    default: {
                        break;
                    }
                }
                gpIntEn[halPinMap[gpioWakeup->pin].gpio_port] |= (0x01 << halPinMap[gpioWakeup->pin].gpio_pin);
            }
        }
        source = source->next;
    }

    if (config) {
        // Disabled GPIOTE NVIC interrupt so that ISR associated with IOE_INT won't
        // be executed if interrupt occurred previous to calling __disable_irq().
        NVIC_DisableIRQ(GPIOTE_IRQn);

        // TODO: check the returned result
        Mcp23s17::getInstance().writeRegister(Mcp23s17::INTCON_ADDR[0], intCon[0]);
        Mcp23s17::getInstance().writeRegister(Mcp23s17::DEFVAL_ADDR[0], defVal[0]);
        Mcp23s17::getInstance().writeRegister(Mcp23s17::GPINTEN_ADDR[0], gpIntEn[0]);
        Mcp23s17::getInstance().writeRegister(Mcp23s17::INTCON_ADDR[1], intCon[1]);
        Mcp23s17::getInstance().writeRegister(Mcp23s17::DEFVAL_ADDR[1], defVal[1]);
        Mcp23s17::getInstance().writeRegister(Mcp23s17::GPINTEN_ADDR[1], gpIntEn[1]);
    }
}
#endif // HAL_PLATFORM_MCP23S17
#endif // HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

