particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
static void configRtcWakeupSource(const hal_wakeup_source_base_t* wakeupSources) {
    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            auto rtcWakeup = reinterpret_cast<const hal_wakeup_source_rtc_t*>(source);
            uint32_t ticks = rtcWakeup->ms / 125;
            // Reconfigure RTC2 for wake-up
            NVIC_ClearPendingIRQ(RTC2_IRQn);

            nrf_rtc_event_disable(NRF_RTC2, RTC_EVTEN_TICK_Msk);
            nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_TICK);

            nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_COMPARE_0);
            nrf_rtc_event_disable(NRF_RTC2, RTC_EVTEN_COMPARE0_Msk);

            // Configure CC0
            uint32_t counter = nrf_rtc_counter_get(NRF_RTC2);
            uint32_t cc = counter + ticks;
            NVIC_EnableIRQ(RTC2_IRQn);
            nrf_rtc_cc_set(NRF_RTC2, 0, cc);
            nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_COMPARE_0);
            nrf_rtc_int_enable(NRF_RTC2, NRF_RTC_INT_COMPARE0_MASK);
            nrf_rtc_event_enable(NRF_RTC2, RTC_EVTEN_COMPARE0_Msk);
            break; // Stop traversing the list.
        }
        source = source->next;
    }
}

static void configLpcompWakeupSource(const hal_wakeup_source_base_t* wakeupSources) {
    hal_pin_info_t* halPinMap = hal_pin_map();
    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
            auto lpcompWakeup = reinterpret_cast<const hal_wakeup_source_lpcomp_t*>(source);
            nrf_lpcomp_config_t config = {};

            NVIC_DisableIRQ(COMP_LPCOMP_IRQn);
            NVIC_ClearPendingIRQ(COMP_LPCOMP_IRQn);

            // Reference voltage is VDD/16 * N, N ranges from 1 to 15, VDD/16 = 206mV
            constexpr uint8_t vddDiv16 = 206;
            constexpr nrf_lpcomp_ref_t refs[] = {
                NRF_LPCOMP_REF_SUPPLY_1_16, NRF_LPCOMP_REF_SUPPLY_1_8,
                NRF_LPCOMP_REF_SUPPLY_3_16, NRF_LPCOMP_REF_SUPPLY_2_8,
                NRF_LPCOMP_REF_SUPPLY_5_16, NRF_LPCOMP_REF_SUPPLY_3_8,
                NRF_LPCOMP_REF_SUPPLY_7_16, NRF_LPCOMP_REF_SUPPLY_4_8,
                NRF_LPCOMP_REF_SUPPLY_9_16, NRF_LPCOMP_REF_SUPPLY_5_8,
                NRF_LPCOMP_REF_SUPPLY_11_16, NRF_LPCOMP_REF_SUPPLY_6_8,
                NRF_LPCOMP_REF_SUPPLY_13_16, NRF_LPCOMP_REF_SUPPLY_7_8,
                NRF_LPCOMP_REF_SUPPLY_15_16
            };
            constexpr uint8_t elements = sizeof(refs) / sizeof(nrf_lpcomp_ref_t);
            uint8_t n = (lpcompWakeup->voltage + (vddDiv16 / 2)) / vddDiv16;
            if (n > elements) {
                n = elements;
            }
            if (n > 0) {
                n--;
            }
            config.reference = refs[n];

            switch (lpcompWakeup->trig) {
                case HAL_SLEEP_LPCOMP_ABOVE: config.detection = NRF_LPCOMP_DETECT_UP; break;
                case HAL_SLEEP_LPCOMP_BELOW: config.detection = NRF_LPCOMP_DETECT_DOWN; break;
                case HAL_SLEEP_LPCOMP_CROSS: config.detection = NRF_LPCOMP_DETECT_CROSS; break;
                default: return;
            }
#ifdef LPCOMP_FEATURE_HYST_PRESENT
            config.hyst = NRF_LPCOMP_HYST_50mV;
#endif
            nrf_lpcomp_configure(&config); // It will disable all interrupts.
            nrf_lpcomp_input_select(static_cast<nrf_lpcomp_input_t>(halPinMap[lpcompWakeup->pin].adc_channel));
            nrf_lpcomp_enable();
            nrf_lpcomp_task_trigger(NRF_LPCOMP_TASK_START);
            while (!nrf_lpcomp_event_check(NRF_LPCOMP_EVENT_READY));
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_READY);
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_DOWN);
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_UP);
            nrf_lpcomp_event_clear(NRF_LPCOMP_EVENT_CROSS);

            switch (lpcompWakeup->trig) {
                case HAL_SLEEP_LPCOMP_ABOVE: {
                    nrf_lpcomp_shorts_enable(NRF_LPCOMP_SHORT_UP_STOP_MASK);
                    nrf_lpcomp_int_enable(LPCOMP_INTENSET_UP_Msk);
                    break;
                }
                case HAL_SLEEP_LPCOMP_BELOW: {
                    nrf_lpcomp_shorts_enable(NRF_LPCOMP_SHORT_DOWN_STOP_MASK);
                    nrf_lpcomp_int_enable(LPCOMP_INTENSET_DOWN_Msk);
                    break;
                }
                case HAL_SLEEP_LPCOMP_CROSS: {
                    nrf_lpcomp_shorts_enable(NRF_LPCOMP_SHORT_CROSS_STOP_MASK);
                    nrf_lpcomp_int_enable(LPCOMP_INTENSET_CROSS_Msk);
                    break;
                }
                default: return; // It should not reach here.
            }
            NVIC_EnableIRQ(COMP_LPCOMP_IRQn);
            break; // Only one analog pin can be configured as wakeup source at a time. Stop traversing the list.
        }
        source = source->next;
    }
}

static uint32_t configUsartWakeupSource(const hal_wakeup_source_base_t* wakeupSources) {
    uint32_t intFlags = NRF_UARTE0->INTENSET;
    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
            nrf_uarte_int_disable(NRF_UARTE0, NRF_UARTE_INT_ERROR_MASK |
                      NRF_UARTE_INT_RXSTARTED_MASK |
                      NRF_UARTE_INT_RXTO_MASK |
                      NRF_UARTE_INT_ENDRX_MASK |
                      NRF_UARTE_INT_TXSTARTED_MASK |
                      NRF_UARTE_INT_TXDRDY_MASK |
                      NRF_UARTE_INT_TXSTOPPED_MASK |
                      NRF_UARTE_INT_ENDTX_MASK);
            NVIC_ClearPendingIRQ(UARTE0_UART0_IRQn);
            /* It potentially has received data already leaving the thread waiting on the data still in a blocked state. */
            // nrf_uarte_int_disable(NRF_UARTE0, NRF_UARTE_INT_RXDRDY_MASK);
            // nrf_uarte_event_clear(NRF_UARTE0, NRF_UARTE_EVENT_RXDRDY);
            if (!nrf_uarte_int_enable_check(NRF_UARTE0, NRF_UARTE_INT_RXDRDY_MASK)) {
                // We're safe to clear the event if application didn't enable the RXDRDY interrupt
                nrf_uarte_event_clear(NRF_UARTE0, NRF_UARTE_EVENT_RXDRDY);
                nrf_uarte_int_enable(NRF_UARTE0, NRF_UARTE_INT_RXDRDY_MASK);
            }
            NVIC_EnableIRQ(UARTE0_UART0_IRQn);
            break; // There is only one USART available for user. Stop traversing the list.
        }
        source = source->next;
    }
    return intFlags;
}

static bool configNetworkWakeupSource(const hal_wakeup_source_base_t* wakeupSources) {
    bool ret = false;
    auto source = wakeupSources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
            auto network = reinterpret_cast<const hal_wakeup_source_network_t*>(source);
            if (!(network->flags & HAL_SLEEP_NETWORK_FLAG_INACTIVE_STANDBY)) {
                /* It potentially has received data already leaving the thread waiting on the data still in a blocked state. */
                // nrf_uarte_int_disable(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK);
                // nrf_uarte_event_clear(NRF_UARTE1, NRF_UARTE_EVENT_RXDRDY);
                if (!nrf_uarte_int_enable_check(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK)) {
                    // We're safe to clear the event if application didn't enable the RXDRDY interrupt
                    nrf_uarte_event_clear(NRF_UARTE1, NRF_UARTE_EVENT_RXDRDY);
                    nrf_uarte_int_enable(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK);
                } else {
                    ret = true;
                }
                NVIC_EnableIRQ(UARTE1_IRQn);
                break; // There is only one USART available for network modem. Stop traversing the list.
            }
        }
        source = source->next;
    }
    return ret;
}

static bool isWokenUpByGpio(const hal_wakeup_source_gpio_t* gpioWakeup) {
    if (!NVIC_GetPendingIRQ(GPIOTE_IRQn)) {
        return false;
    }
    hal_pin_info_t* halPinMap = hal_pin_map();
    hal_pin_t wakeupPin;

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_MCU) {
#endif
        wakeupPin = gpioWakeup->pin;
#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
    }
#if HAL_PLATFORM_MCP23S17
    else if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER) {
        wakeupPin = IOE_INT;
    }
#endif
    else {
        return false;
    }
#endif

    if (nrf_gpiote_event_is_set(NRF_GPIOTE_EVENTS_PORT)) {
        // PORT event
        uint32_t nrfPin = NRF_GPIO_PIN_MAP(halPinMap[wakeupPin].gpio_port, halPinMap[wakeupPin].gpio_pin);
        nrf_gpio_pin_sense_t sense = nrf_gpio_pin_sense_get(nrfPin);
        if (sense != NRF_GPIO_PIN_NOSENSE) {
            uint32_t state = nrf_gpio_pin_read(nrfPin);
            if ((state && sense == NRF_GPIO_PIN_SENSE_HIGH) || (!state && sense == NRF_GPIO_PIN_SENSE_LOW)) {
                return true;
            }
        }
    } else {
        // Check IN events
        for (unsigned i = 0; i < GPIOTE_CH_NUM; ++i) {
            if (NRF_GPIOTE->EVENTS_IN[i] && nrf_gpiote_int_is_enabled(NRF_GPIOTE_INT_IN0_MASK << i)) {
                hal_pin_t pin = NRF_PIN_LOOKUP_TABLE[nrf_gpiote_event_pin_get(i)];
                if (pin == wakeupPin) {
                    return true;
                }
            }
        }
    }

