particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
    return false;
}

static bool isWokenUpByRtc() {
    return NVIC_GetPendingIRQ(RTC2_IRQn);
}

static bool isWokenUpByUsart() {
    return NVIC_GetPendingIRQ(UARTE0_UART0_IRQn);
}

static bool isWokenUpByBle() {
    return NVIC_GetPendingIRQ(SD_EVT_IRQn);
}

static bool isWokenUpByLpcomp() {
    return NVIC_GetPendingIRQ(COMP_LPCOMP_IRQn);
}

static bool isWokenUpByNetwork(const hal_wakeup_source_network_t* networkWakeup, const uint32_t ncpId) {
// TODO: More than one network interface are supported on platform.
    if (networkWakeup->flags & HAL_SLEEP_NETWORK_FLAG_INACTIVE_STANDBY) {
        return false;
    }
#if HAL_PLATFORM_CELLULAR
    if (networkWakeup->index == NETWORK_INTERFACE_CELLULAR && NVIC_GetPendingIRQ(UARTE1_IRQn)) {
        // XXX: u-blox issue where RXD pin toggles to HI-Z for ~10us about 1ms after CTS goes HIGH
        //      while modem is in UPSV=1 mode and in a low power state.  We see a low pulse due to
        //      10k pull-down on RXD. These will occur every 1.28s.  If we wake up via R510 cellular
        //      network activity, and CTS is HIGH, go back to sleep.
        // Is CTS pin HIGH? (clear pending interrupt and return false)
        if (ncpId == PLATFORM_NCP_SARA_R510) {
            hal_pin_info_t* halPinMap = hal_pin_map();
            uint32_t cts1Pin = NRF_GPIO_PIN_MAP(halPinMap[CTS1].gpio_port, halPinMap[CTS1].gpio_pin);
            uint32_t cts1State = nrf_gpio_pin_read(cts1Pin);
            if (cts1State) {
                nrf_uarte_event_clear(NRF_UARTE1, NRF_UARTE_EVENT_RXDRDY);
                nrf_uarte_int_enable(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK);
                NVIC_ClearPendingIRQ(UARTE1_IRQn);
                return false;
            }
        }
        return true;
    }
#endif
#if HAL_PLATFORM_WIFI
    if (networkWakeup->index == NETWORK_INTERFACE_WIFI_STA && NVIC_GetPendingIRQ(UARTE1_IRQn)) {
        return true;
    }
#endif
    return false;
}

static int validateGpioWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_gpio_t* gpio) {
    switch(gpio->mode) {
        case RISING:
        case FALLING:
        case CHANGE: {
            break;
        }
        default: {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
    }
    if (gpio->type == HAL_PIN_TYPE_RTC) {
#if HAL_PLATFORM_EXTERNAL_RTC && !HAL_PLATFORM_EXTERNAL_RTC_OPTIONAL
        if (gpio->mode == CHANGE) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        if (mode != HAL_SLEEP_MODE_HIBERNATE && mode != HAL_SLEEP_MODE_POWER_OFF) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
        return SYSTEM_ERROR_NONE;
#else
        return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }
    if (mode == HAL_SLEEP_MODE_POWER_OFF) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    if (gpio->pin >= TOTAL_PINS) {
        return SYSTEM_ERROR_LIMIT_EXCEEDED;
    }
    return SYSTEM_ERROR_NONE;
}

static int validateRtcWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_rtc_t* rtc) {
    if (rtc->ms == 0) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (mode == HAL_SLEEP_MODE_HIBERNATE || mode == HAL_SLEEP_MODE_POWER_OFF) {
#if HAL_PLATFORM_EXTERNAL_RTC && !HAL_PLATFORM_EXTERNAL_RTC_OPTIONAL
        if ((rtc->ms / 1000) == 0) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
#else
        return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
    }
    return SYSTEM_ERROR_NONE;
}

static int validateUsartWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_usart_t* usart) {
    if (!hal_usart_is_enabled(usart->serial)) {
        return SYSTEM_ERROR_INVALID_STATE;
    }
    if (mode == HAL_SLEEP_MODE_HIBERNATE) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return SYSTEM_ERROR_NONE;
}

static int validateNetworkWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_network_t* network) {
    if (!(network->flags & HAL_SLEEP_NETWORK_FLAG_INACTIVE_STANDBY)) {
#if HAL_PLATFORM_CELLULAR
        if (network->index == NETWORK_INTERFACE_CELLULAR &&
                !hal_usart_is_enabled(HAL_PLATFORM_CELLULAR_SERIAL)) {
#elif HAL_PLATFORM_WIFI && !HAL_PLATFORM_WIFI_NCP_SDIO
        if (network->index == NETWORK_INTERFACE_WIFI_STA &&
                !hal_usart_is_enabled(HAL_PLATFORM_WIFI_SERIAL)) {
#endif
            return SYSTEM_ERROR_INVALID_STATE;
        }
        if (mode == HAL_SLEEP_MODE_HIBERNATE) {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
    }
    return SYSTEM_ERROR_NONE;
}

static int validateBleWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_base_t* base) {
    if (mode == HAL_SLEEP_MODE_HIBERNATE) {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return SYSTEM_ERROR_NONE;
}

static int validateLpcompWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_lpcomp_t* lpcomp) {
    if (hal_pin_validate_function(lpcomp->pin, PF_ADC) != PF_ADC) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    if (lpcomp->trig > HAL_SLEEP_LPCOMP_CROSS) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }
    return SYSTEM_ERROR_NONE;
}

static int validateWakeupSource(hal_sleep_mode_t mode, const hal_wakeup_source_base_t* base) {
    if (base->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
        return validateGpioWakeupSource(mode, reinterpret_cast<const hal_wakeup_source_gpio_t*>(base));
    } else if (base->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
        return validateRtcWakeupSource(mode, reinterpret_cast<const hal_wakeup_source_rtc_t*>(base));
    } else if (base->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
        return validateUsartWakeupSource(mode, reinterpret_cast<const hal_wakeup_source_usart_t*>(base));
    } else if (base->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
        return validateNetworkWakeupSource(mode, reinterpret_cast<const hal_wakeup_source_network_t*>(base));
    } else if (base->type == HAL_WAKEUP_SOURCE_TYPE_BLE) {
        return validateBleWakeupSource(mode, base);
    } else if (base->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
        return validateLpcompWakeupSource(mode, reinterpret_cast<const hal_wakeup_source_lpcomp_t*>(base));
    }
    return SYSTEM_ERROR_NOT_SUPPORTED;
}

