particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
static void fpu_sleep_prepare(void) {
    uint32_t fpscr;
    fpscr = __get_FPSCR();
    /*
     * Clear FPU exceptions.
     * Without this step, the FPU interrupt is marked as pending,
     * preventing system from sleeping. Exceptions cleared:
     * - IOC - Invalid Operation cumulative exception bit.
     * - DZC - Division by Zero cumulative exception bit.
     * - OFC - Overflow cumulative exception bit.
     * - UFC - Underflow cumulative exception bit.
     * - IXC - Inexact cumulative exception bit.
     * - IDC - Input Denormal cumulative exception bit.
     */
    __set_FPSCR(fpscr & ~0x9Fu);
    __DMB();
    NVIC_ClearPendingIRQ(FPU_IRQn);

    /*__
     * Assert no critical FPU exception is signaled:
     * - IOC - Invalid Operation cumulative exception bit.
     * - DZC - Division by Zero cumulative exception bit.
     * - OFC - Overflow cumulative exception bit.
     */
    SPARK_ASSERT((fpscr & 0x07) == 0);
}

static int enterStopBasedSleep(const hal_sleep_config_t* config, hal_wakeup_source_base_t** wakeupReason) {
    int ret = SYSTEM_ERROR_NONE;
    uint32_t ncpId = platform_primary_ncp_identifier(); // save before external flash is put to sleep

    // Detach USB
    HAL_USB_Detach();

    // Flush all USARTs
    // FIXME: no lock
    for (int usart = 0; usart < HAL_PLATFORM_USART_NUM; usart++) {
        if (hal_usart_is_enabled(static_cast<hal_usart_interface_t>(usart))) {
            hal_usart_flush(static_cast<hal_usart_interface_t>(usart));
        }
    }

    /* We neeed to configure the IO expander interrupt before disabling SPI interface. */
#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
    Mcp23s17::getInstance().interruptsSuspend();
    configGpioWakeupSourceExt(config->wakeup_sources, config->mode);
#endif
#endif

    // We need to do this before disabling systick/interrupts, otherwise
    // there is a high chance of a deadlock
    if (config->mode == HAL_SLEEP_MODE_ULTRA_LOW_POWER) {
        // Do not suspend the usarts those are featured as wakeup source.
        Vector<hal_usart_interface_t> skipUsarts;
        for (const hal_wakeup_source_base_t* src = config->wakeup_sources; src != nullptr; src = src->next) {
            if (src->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
                const auto networkSource = reinterpret_cast<const hal_wakeup_source_network_t*>(src);
#if HAL_PLATFORM_CELLULAR
                if (networkSource->index == NETWORK_INTERFACE_CELLULAR) {
                    skipUsarts.append(HAL_PLATFORM_CELLULAR_SERIAL);
                }
#endif
#if HAL_PLATFORM_WIFI && !HAL_PLATFORM_WIFI_NCP_SDIO
                if (networkSource->index == NETWORK_INTERFACE_WIFI_STA) {
                    skipUsarts.append(HAL_PLATFORM_WIFI_SERIAL);
                }
#endif
            } else if (src->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
                const auto usartSource = reinterpret_cast<const hal_wakeup_source_usart_t*>(src);
                skipUsarts.append(usartSource->serial);
            }
        }

        for (int usart = 0; usart < HAL_PLATFORM_USART_NUM; usart++) {
            // FIXME: no lock
            // FIXME: we cannot reliably put NCP UART into sleep now without any thread-safety issues
            // We need to properly signal NCP client before going into sleep that it cannnot use
            // USART for a while.
            if (!skipUsarts.contains(static_cast<hal_usart_interface_t>(usart))) {
                hal_usart_sleep(static_cast<hal_usart_interface_t>(usart), true, nullptr);
            }
        }
        // Suspend SPIs
        for (int spi = 0; spi < HAL_PLATFORM_SPI_NUM; spi++) {
            hal_spi_acquire(static_cast<hal_spi_interface_t>(spi), nullptr);
            hal_spi_sleep(static_cast<hal_spi_interface_t>(spi), true, nullptr);
        }
        // Suspend I2Cs
        for (int i2c = 0; i2c < HAL_PLATFORM_I2C_NUM; i2c++) {
            hal_i2c_lock(static_cast<hal_i2c_interface_t>(i2c), nullptr);
            hal_i2c_sleep(static_cast<hal_i2c_interface_t>(i2c), true, nullptr);
        }
    }

    // Make sure we acquire exflash lock BEFORE going into a critical section
    hal_exflash_lock();

    // BLE events should be dealt before disabling thread scheduling.
    auto bleWakeupSource = findWakeupSource(config->wakeup_sources, HAL_WAKEUP_SOURCE_TYPE_BLE);
    bool advertising = hal_ble_gap_is_advertising(nullptr) ||
                       hal_ble_gap_is_connecting(nullptr, nullptr) ||
                       hal_ble_gap_is_connected(nullptr, nullptr);
    if (!bleWakeupSource) {
        // Make sure we acquire BLE lock BEFORE going into a critical section
        hal_ble_lock(nullptr);
        hal_ble_stack_deinit(nullptr);
        disableRadioAntenna();
    }

    // Disable thread scheduling
    os_thread_scheduling(false, nullptr);

    if (config->mode == HAL_SLEEP_MODE_ULTRA_LOW_POWER) {
        // Suspend ADC module
        hal_adc_sleep(true, nullptr);
    }

    // This will disable all but SoftDevice interrupts (by modifying NVIC->ICER)
    uint8_t st = 0;
    sd_nvic_critical_region_enter(&st);

    // Disable SysTick
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;

    // Put external flash into sleep and disable QSPI peripheral
    hal_exflash_sleep(true, nullptr);

    // Suspend PWM modules after disabling systick, as RGB pins are managed there
    hal_pwm_sleep(true, nullptr);

    // _Attempt_ to disable HFCLK. This may not succeed, resulting in a higher current consumption
    // FIXME
    bool hfclkResume = false;
    if (nrf_drv_clock_hfclk_is_running()) {
        hfclkResume = true;

        // Temporarily enable SoftDevice API interrupts just in case
        uint32_t basePri = __get_BASEPRI();
        // We are also allowing IRQs with priority = 5
        // FIXME: because that's what OpenThread used for its SWI3
        __set_BASEPRI(_PRIO_APP_LOW << (8 - __NVIC_PRIO_BITS));
        sd_nvic_critical_region_exit(st);
        {
            nrf_drv_clock_hfclk_release();
            // while (nrf_drv_clock_hfclk_is_running());
        }
        // And disable again
        sd_nvic_critical_region_enter(&st);
        __set_BASEPRI(basePri);
    }

