particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
    // Remember current microsecond counter
    uint64_t microsBeforeSleep = hal_timer_micros(nullptr);
    // Disable hal_timer (RTC2)
    hal_timer_deinit(nullptr);

    // Make sure LFCLK is running
    nrf_drv_clock_lfclk_request(nullptr);
    while (!nrf_drv_clock_lfclk_is_running());

    // Configure RTC2 to count at 125ms interval. This should allow us to sleep
    // (2^24 - 1) * 125ms = 24 days
    NVIC_SetPriority(RTC2_IRQn, 6);
    // Make sure that the RTC is stopped and cleared
    nrf_rtc_task_trigger(NRF_RTC2, NRF_RTC_TASK_STOP);
    nrf_rtc_task_trigger(NRF_RTC2, NRF_RTC_TASK_CLEAR);
    __DSB();
    __ISB();

    // For some reason even though the RTC should be stopped by now,
    // the prescaler is still read-only. So, we loop here to make sure that the
    // prescaler settings does take effect.
    static const uint32_t prescaler = 4095;
    while (rtc_prescaler_get(NRF_RTC2) != prescaler) {
        nrf_rtc_prescaler_set(NRF_RTC2, prescaler);
        __DSB();
        __ISB();
    }
    // Start RTC2
    nrf_rtc_task_trigger(NRF_RTC2, NRF_RTC_TASK_START);
    __DSB();
    __ISB();

    // WARNING: This is going to fix the issue that when both .ble() and .duration()
    // are specified as wakeup sources, device will run into hardfault if the following
    // check comes after __disable_irq(), such as in configRtcWakeupSource() previously.
    nrf_rtc_event_enable(NRF_RTC2, RTC_EVTEN_TICK_Msk);
    // Make sure that RTC is ticking
    // See 'TASK and EVENT jitter/delay'
    // http://infocenter.nordicsemi.com/index.jsp?topic=%2Fcom.nordic.infocenter.nrf52840.ps%2Frtc.html
    while (!nrf_rtc_event_pending(NRF_RTC2, NRF_RTC_EVENT_TICK));
    nrf_rtc_event_disable(NRF_RTC2, RTC_EVTEN_TICK_Msk);
    nrf_rtc_event_clear(NRF_RTC2, NRF_RTC_EVENT_TICK);

    // Workaround for FPU anomaly
    fpu_sleep_prepare();

    /* Do not allow any ISR to be executed starting from here. */
    __disable_irq();

    // Suspend all GPIOTE interrupts
    hal_interrupt_suspend();

    configGpioWakeupSource(config->wakeup_sources);
    configRtcWakeupSource(config->wakeup_sources);
    configLpcompWakeupSource(config->wakeup_sources);
    uint32_t intFlags = configUsartWakeupSource(config->wakeup_sources);
    bool networkRxdRdy = configNetworkWakeupSource(config->wakeup_sources);

    // Masks all interrupts lower than softdevice. This allows us to be woken ONLY by softdevice
    // or GPIOTE and RTC.
    // IMPORTANT: No SoftDevice API calls are allowed until HAL_enable_irq()
    // TODO: we have bumped the SD_EVT_IRQn priority, so we can probably always call HAL_disable_irq() here.
    int hst = 0;
    if (!bleWakeupSource) {
        hst = HAL_disable_irq();
    }

    __DSB();
    __ISB();

    hal_wakeup_source_type_t wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_UNKNOWN;
    hal_pin_t wakeupPin = PIN_INVALID;
    network_interface_index netif = NETWORK_INTERFACE_ALL;

    bool exitSleepMode = false;
    while (true) {
        // Mask interrupts completely
        __disable_irq();

        // Bump the priority
        WakeupSourcePriorityCache priorityCache = {};
        bumpWakeupSourcesPriority(config->wakeup_sources, &priorityCache, 0);

        __DSB();
        __ISB();

        // Go to sleep
        __WFI();

        // Figure out the wakeup source
        auto wakeupSource = config->wakeup_sources;
        while (wakeupSource) {
            if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                auto gpioWakeup = reinterpret_cast<hal_wakeup_source_gpio_t*>(wakeupSource);
                if (isWokenUpByGpio(gpioWakeup)) {
                    wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_GPIO;
                    wakeupPin = gpioWakeup->pin;
                    exitSleepMode = true;
                    // Only if we've figured out the wakeup pin, then we stop traversing the wakeup sources list.
                    break;
                }
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_RTC && isWokenUpByRtc()) {
                wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_RTC;
                exitSleepMode = true;
                break; // Stop traversing the wakeup sources list.
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_BLE && isWokenUpByBle()) {
                wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_BLE;
                exitSleepMode = true;
                break; // Stop traversing the wakeup sources list.
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP && isWokenUpByLpcomp()) {
                auto lpcompWakeup = reinterpret_cast<hal_wakeup_source_lpcomp_t*>(wakeupSource);
                wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_LPCOMP;
                wakeupPin = lpcompWakeup->pin;
                exitSleepMode = true;
                break; // Stop traversing the wakeup sources list.
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_USART && isWokenUpByUsart()) {
                wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_USART;
                exitSleepMode = true;
                break; // Stop traversing the wakeup sources list.
            } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
                auto networkWakeup = reinterpret_cast<hal_wakeup_source_network_t*>(wakeupSource);
                if (isWokenUpByNetwork(networkWakeup, ncpId)) {
                    wakeupSourceType = HAL_WAKEUP_SOURCE_TYPE_NETWORK;
                    netif = networkWakeup->index;
                    exitSleepMode = true;
                    break; // Stop traversing the wakeup sources list.
                }
            }
            wakeupSource = wakeupSource->next;
        }

        // Unbump the priority before __enable_irq().
        unbumpWakeupSourcesPriority(config->wakeup_sources, &priorityCache);

        // Unmask interrupts so that SoftDevice can still process BLE events.
        // we are still under the effect of HAL_disable_irq that masked all but SoftDevice interrupts using BASEPRI
        __enable_irq();

