particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
        /*
         * Wake-up on BLE events relies mainly on SD_EVT_IRQn interrupt, which will be disabled through NVIC (not masked)
         * when entering sd_nvic_critical_region_enter(). Normally on BLE activity we would be woken up by other high-priority
         * SoftDevice interrupts (e.g. timers, radio events etc), however SD_EVT_IRQn would be set as pending only after we
         * unmask high-priority SoftDevice interrupts (__enable_irq()) and after the appropriate SoftDevice interrupt handlers
         * finish executing. We would then immediately go back to sleep and wouldn't notice this change in SD_EVT_IRQn state.
         * As a workaround, for the duration of the sleep, we'll be bumping the priority of SD_EVT_IRQn, so that it can wake
         * us up from stop mode (WFI) as well.
         */

        // Exit the while(true) loop to exit from sleep mode.
        if (exitSleepMode) {
            break;
        }
    }

    // Restore HFCLK
    if (hfclkResume) {
        // Temporarily enable SoftDevice API interrupts
        uint32_t basePri = __get_BASEPRI();
        __set_BASEPRI(_PRIO_SD_LOWEST << (8 - __NVIC_PRIO_BITS));
        {
            nrf_drv_clock_hfclk_request(nullptr);
            while (!nrf_drv_clock_hfclk_is_running()) {
                ;
            }
        }
        // And disable again
        __set_BASEPRI(basePri);
    }

    auto source = config->wakeup_sources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_USART) {
            nrf_uarte_int_enable(NRF_UARTE0, intFlags);
            break; // There is only one USART available for user. Stop traversing the list.
        }
        source = source->next;
    }
    if (networkRxdRdy) {
        nrf_uarte_int_enable(NRF_UARTE1, NRF_UARTE_INT_RXDRDY_MASK);
    }

    nrf_lpcomp_disable();

    // Count the number of microseconds we've slept and reconfigure hal_timer (RTC2)
    uint64_t microsAftereSleep = (uint64_t)nrf_rtc_counter_get(NRF_RTC2) * 125000;
    // Stop RTC2
    nrf_rtc_task_trigger(NRF_RTC2, NRF_RTC_TASK_STOP);
    nrf_rtc_task_trigger(NRF_RTC2, NRF_RTC_TASK_CLEAR);
    // Reconfigure it hal_timer_init() and apply the offset
    hal_timer_init_config_t halTimerConfig = {
        .size = sizeof(hal_timer_init_config_t),
        .version = 0,
        .base_clock_offset = microsBeforeSleep + microsAftereSleep
    };
    hal_timer_init(&halTimerConfig);

    // Restore GPIOTE cionfiguration
    hal_interrupt_restore();

    // Re-initialize external flash
    // If we fail to re-initialize it, there is no point in continuing to wake-up
    // as the system will anyway not be functional
    int exflashResume = hal_exflash_sleep(false, nullptr);
    if (exflashResume == SYSTEM_ERROR_INVALID_STATE) {
        // We've previously failed to correctly put the QSPI flash into sleep
        // Attempt to initialize
        // Just in case uninit
        hal_exflash_uninit();
        exflashResume = hal_exflash_init();
    }
    SPARK_ASSERT(exflashResume == 0);

    // Restore PWM state
    hal_pwm_sleep(false, nullptr);

    // Re-enable SysTick
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;

    // This will reenable all non-SoftDevice interrupts previously disabled
    // by sd_nvic_critical_region_enter()
    sd_nvic_critical_region_exit(st);

    // Unmasks all non-softdevice interrupts
    HAL_enable_irq(hst);

    // Release LFCLK
    nrf_drv_clock_lfclk_release();

    // Re-enable USB
    HAL_USB_Attach();

    // Unlock external flash
    hal_exflash_unlock();

    if (!bleWakeupSource) {
        hal_ble_stack_init(nullptr);
        if (advertising) {
            hal_ble_gap_start_advertising(nullptr);
        }
        hal_ble_unlock(nullptr);
        enableRadioAntenna();
    }

    if (config->mode == HAL_SLEEP_MODE_ULTRA_LOW_POWER) {
        // Re-enable ADC module
        // FIXME: no lock
        hal_adc_sleep(false, nullptr);

        // Restore I2Cs
        for (int i2c = 0; i2c < HAL_PLATFORM_I2C_NUM; i2c++) {
            hal_i2c_sleep(static_cast<hal_i2c_interface_t>(i2c), false, nullptr);
            hal_i2c_unlock(static_cast<hal_i2c_interface_t>(i2c), nullptr);
        }
        // Restore SPIs
        for (int spi = 0; spi < HAL_PLATFORM_SPI_NUM; spi++) {
            hal_spi_sleep(static_cast<hal_spi_interface_t>(spi), false, nullptr);
            hal_spi_release(static_cast<hal_spi_interface_t>(spi), nullptr);
        }
        // Restore USARTs
        for (int usart = 0; usart < HAL_PLATFORM_USART_NUM; usart++) {
            // FIXME: no lock
            hal_usart_sleep(static_cast<hal_usart_interface_t>(usart), false, nullptr);
        }
    }

#if HAL_PLATFORM_IO_EXTENSION && MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
#if HAL_PLATFORM_MCP23S17
    uint8_t intStatus[2];
    Mcp23s17::getInstance().interruptsRestore(intStatus);
    hal_pin_info_t* halPinMap = hal_pin_map();
    if (halPinMap[wakeupPin].type == HAL_PIN_TYPE_IO_EXPANDER) {
        // We need to identify the exact wakeup pin attached to the IO expander.
        source = config->wakeup_sources;
        while (source) {
            if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
                auto gpioWakeup = reinterpret_cast<hal_wakeup_source_gpio_t*>(source);
                uint8_t bitMask = 0x01 << halPinMap[gpioWakeup->pin].gpio_pin;
                uint8_t port = halPinMap[gpioWakeup->pin].gpio_port;
                if (halPinMap[gpioWakeup->pin].type == HAL_PIN_TYPE_IO_EXPANDER) {
                    if (intStatus[port] & bitMask) {
                        wakeupPin = gpioWakeup->pin;
                        break;
                    }
                }
            }
            source = source->next;
        }
    }
#endif
#endif

    // Enable thread scheduling
    os_thread_scheduling(true, nullptr);

    if (wakeupReason) {
        if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            ret = constructGpioWakeupReason(wakeupReason, wakeupPin);
        } else if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            ret = constructRtcWakeupReason(wakeupReason);
        } else if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_USART) {
            ret = constructUsartWakeupReason(wakeupReason);
        } else if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_BLE) {
            ret = constructBleWakeupReason(wakeupReason);
        } else if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
            ret = constructLpcompWakeupReason(wakeupReason, wakeupPin);
        } else if (wakeupSourceType == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
            ret = constructNetworkWakeupReason(wakeupReason, netif);
        } else {
            ret = SYSTEM_ERROR_INTERNAL;
        }
    }

    return ret;
}

static int enterPowerOffMode(const hal_sleep_config_t* config) {
#if HAL_PLATFORM_EXTERNAL_RTC
    hal_exrtc_sleep_config_t sleep = {};
    sleep.version = HAL_EXRTC_API_VERSION;
    sleep.size = sizeof(sleep);
    sleep.exti_mode = CHANGE;

