particle-iot/device-os/hal/src/nRF52840/sleep_hal.cpp
    auto source = config->wakeup_sources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            auto gpio = reinterpret_cast<const hal_wakeup_source_gpio_t*>(source);
            CHECK_TRUE(gpio->type == HAL_PIN_TYPE_RTC, SYSTEM_ERROR_NOT_SUPPORTED);
            CHECK_TRUE(sleep.exti_mode == CHANGE, SYSTEM_ERROR_NOT_SUPPORTED);
            switch (gpio->mode) {
                case FALLING:
                case RISING: {
                    sleep.exti_mode = gpio->mode;
                    break;
                }
                default: {
                    return SYSTEM_ERROR_NOT_SUPPORTED;
                }
            }
        } else if (source->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            auto rtc = reinterpret_cast<const hal_wakeup_source_rtc_t*>(source);
            CHECK_TRUE(sleep.duration == 0, SYSTEM_ERROR_NOT_SUPPORTED);
            sleep.duration = rtc->ms / 1000;
            CHECK_TRUE(sleep.duration > 0, SYSTEM_ERROR_INVALID_ARGUMENT);
        } else {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
        source = source->next;
    }

    return hal_exrtc_command(HAL_EXRTC_INSTANCE_DEFAULT, HAL_EXRTC_COMMAND_SLEEP, &sleep, 0, nullptr);
#else
    return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
}

static int enterHibernateMode(const hal_sleep_config_t* config, hal_wakeup_source_base_t** wakeupReason) {
#if HAL_PLATFORM_EXTERNAL_RTC
    if (config->mode == HAL_SLEEP_MODE_POWER_OFF) {
        return enterPowerOffMode(config);
    }
#endif
#if HAL_PLATFORM_EXTERNAL_RTC
    auto source = config->wakeup_sources;
    while (source) {
        if (source->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            auto rtcWakeup = reinterpret_cast<const hal_wakeup_source_rtc_t*>(source);
            auto seconds = rtcWakeup->ms / 1000;
            struct timeval tv = {
                .tv_sec = seconds,
                .tv_usec = 0
            };
            CHECK(hal_rtc_set_alarm(&tv, HAL_RTC_ALARM_FLAG_IN, nullptr, nullptr, nullptr));
        }
        source = source->next;
    }
 #endif

    // Make sure we acquire exflash lock BEFORE going into a critical section
    hal_exflash_lock();

    // Disable thread scheduling
    os_thread_scheduling(false, nullptr);

    // Suspend USARTs
    for (int usart = 0; usart < HAL_PLATFORM_USART_NUM; usart++) {
        hal_usart_sleep(static_cast<hal_usart_interface_t>(usart), true, nullptr);
    }
    // Suspend SPIs
    for (int spi = 0; spi < HAL_PLATFORM_SPI_NUM; spi++) {
        hal_spi_sleep(static_cast<hal_spi_interface_t>(spi), true, nullptr);
    }
    // Suspend I2Cs
    for (int i2c = 0; i2c < HAL_PLATFORM_I2C_NUM; i2c++) {
        hal_i2c_sleep(static_cast<hal_i2c_interface_t>(i2c), true, nullptr);
    }
    // Suspend PWM modules
    hal_pwm_sleep(true, nullptr);
    // Suspend ADC module
    hal_adc_sleep(true, nullptr);

    // This will disable all but SoftDevice interrupts (by modifying NVIC->ICER)
    uint8_t st = 0;
    sd_nvic_critical_region_enter(&st);

    // Disable SysTick
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;

    // Put external flash into sleep mode and disable QSPI peripheral
    hal_exflash_sleep(true, nullptr);

    // Uninit GPIOTE
    nrfx_gpiote_uninit();

    // Disable low power comparator
    nrf_lpcomp_disable();

    // Deconfigure any possible SENSE configuration
    hal_interrupt_suspend();

    // Disable GPIOTE PORT interrupts
    nrf_gpiote_int_disable(GPIOTE_INTENSET_PORT_Msk);

    // Clear any GPIOTE events
    nrf_gpiote_event_clear(NRF_GPIOTE_EVENTS_PORT);

    disableRadioAntenna();

    auto wakeupSource = config->wakeup_sources;
    while (wakeupSource) {
        if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_GPIO) {
            hal_pin_info_t* halPinMap = hal_pin_map();
            auto gpioWakeup = reinterpret_cast<hal_wakeup_source_gpio_t*>(wakeupSource);
            if (gpioWakeup->type == HAL_PIN_TYPE_RTC) {
#if HAL_PLATFORM_EXTERNAL_RTC && !HAL_PLATFORM_EXTERNAL_RTC_OPTIONAL
                uint32_t nrfPin = NRF_GPIO_PIN_MAP(halPinMap[RTC_INT].gpio_port, halPinMap[RTC_INT].gpio_pin);
                nrf_gpio_cfg_sense_input(nrfPin, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_SENSE_LOW);
                wakeupSource = wakeupSource->next;
                continue;
#else
                return SYSTEM_ERROR_NOT_SUPPORTED;
#endif
            }
            nrf_gpio_pin_pull_t wakeupPinMode;
            nrf_gpio_pin_sense_t wakeupPinSense;
            switch(gpioWakeup->mode) {
                case RISING: {
                    wakeupPinMode = NRF_GPIO_PIN_PULLDOWN;
                    wakeupPinSense = NRF_GPIO_PIN_SENSE_HIGH;
                    break;
                }
                case FALLING: {
                    wakeupPinMode = NRF_GPIO_PIN_PULLUP;
                    wakeupPinSense = NRF_GPIO_PIN_SENSE_LOW;
                    break;
                }
                case CHANGE:
                default: {
                    wakeupPinMode = NRF_GPIO_PIN_NOPULL;
                    break;
                }
            }
            uint32_t nrfPin = NRF_GPIO_PIN_MAP(halPinMap[gpioWakeup->pin].gpio_port, halPinMap[gpioWakeup->pin].gpio_pin);
            // Set pin mode
            if (wakeupPinMode == NRF_GPIO_PIN_NOPULL) {
                nrf_gpio_cfg_input(nrfPin, wakeupPinMode);
                // Read current state, choose sense accordingly
                // Dummy read just in case
                (void)nrf_gpio_pin_read(nrfPin);
                uint32_t cur_state = nrf_gpio_pin_read(nrfPin);
                if (cur_state) {
                    nrf_gpio_cfg_sense_set(nrfPin, NRF_GPIO_PIN_SENSE_LOW);
                } else {
                    nrf_gpio_cfg_sense_set(nrfPin, NRF_GPIO_PIN_SENSE_HIGH);
                }
            } else {
                nrf_gpio_cfg_sense_input(nrfPin, wakeupPinMode, wakeupPinSense);
            }
        } else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_LPCOMP) {
            configLpcompWakeupSource(wakeupSource);
        }
#if HAL_PLATFORM_EXTERNAL_RTC && !HAL_PLATFORM_EXTERNAL_RTC_OPTIONAL
        else if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_RTC) {
            hal_pin_info_t* halPinMap = hal_pin_map();
            uint32_t nrfPin = NRF_GPIO_PIN_MAP(halPinMap[RTC_INT].gpio_port, halPinMap[RTC_INT].gpio_pin);
            nrf_gpio_cfg_sense_input(nrfPin, NRF_GPIO_PIN_PULLUP, NRF_GPIO_PIN_SENSE_LOW);
        }
#endif
        wakeupSource = wakeupSource->next;
    }

    // RAM retention is configured on early boot in Set_System()

    SPARK_ASSERT(sd_power_system_off() == NRF_SUCCESS);
    while (1);
    return SYSTEM_ERROR_NONE;
}

int hal_sleep_validate_config(const hal_sleep_config_t* config, void* reserved) {
    // Checks the sleep mode.
    if (config->mode == HAL_SLEEP_MODE_NONE || config->mode >= HAL_SLEEP_MODE_MAX) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    // Checks the wakeup sources
    auto wakeupSource = config->wakeup_sources;
    uint16_t valid = 0;
    while (wakeupSource) {
        CHECK(validateWakeupSource(config->mode, wakeupSource));
        if (wakeupSource->type == HAL_WAKEUP_SOURCE_TYPE_NETWORK) {
            auto network = reinterpret_cast<const hal_wakeup_source_network_t*>(wakeupSource);
            if (!(network->flags & HAL_SLEEP_NETWORK_FLAG_INACTIVE_STANDBY)) {
                valid++;
            }
        } else {
            valid++;
        }
        wakeupSource = wakeupSource->next;
    }
    // At least one wakeup source should be configured for stop and ultra-low power mode.
    if ((config->mode == HAL_SLEEP_MODE_STOP || config->mode == HAL_SLEEP_MODE_ULTRA_LOW_POWER) && (!config->wakeup_sources || !valid)) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    return SYSTEM_ERROR_NONE;
}

int hal_sleep_enter(const hal_sleep_config_t* config, hal_wakeup_source_base_t** wakeup_source, void* reserved) {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);

    // Check it again just in case.
    CHECK(hal_sleep_validate_config(config, nullptr));

    int ret = SYSTEM_ERROR_NONE;

    switch (config->mode) {
        case HAL_SLEEP_MODE_STOP:
        case HAL_SLEEP_MODE_ULTRA_LOW_POWER: {
            ret = enterStopBasedSleep(config, wakeup_source);
            break;
        }
        case HAL_SLEEP_MODE_HIBERNATE:
        case HAL_SLEEP_MODE_POWER_OFF: {
            ret = enterHibernateMode(config, wakeup_source);
            break;
        }
        default: {
            ret = SYSTEM_ERROR_NOT_SUPPORTED;
            break;
        }
    }

    return ret;
}
